In [1]:
# imports
from sqlalchemy import create_engine
import pandas as pd
from warnings import filterwarnings
import pymysql, json
filterwarnings('ignore', category=pymysql.Warning)
import os
import json

In [2]:
# declare constants
ball = os.path.dirname(os.path.dirname(os.path.realpath('__file__')))
ball = os.path.join(ball, "keyring.json")
ball = json.load(open(ball))
pw = ball["I_am_root"]
engine = create_engine(f'mysql+pymysql://root:{pw}@localhost/sakila')

In [3]:
# declare functions
def RunSQL(sql_command):
    connection = pymysql.connect(host='localhost',
                             user='root',
                             password=pw,
                             db='sakila',
                             charset='utf8mb4',
                             cursorclass=pymysql.cursors.DictCursor)
    try:
        with connection.cursor() as cursor:
            commands = sql_command.split(';')
            for command in commands:
                if command == '\n': continue
                cursor.execute(command + ';')
                connection.commit()
    except Exception as e: 
        print(e)
    finally:
        connection.close()

1a. Display the first and last names of all actors from the table actor.

In [4]:
pd.read_sql_query("""
select first_name, last_name
from actor
""", engine).head()

  first_name     last_name
0   PENELOPE       GUINESS
1       NICK      WAHLBERG
2         ED         CHASE
3   JENNIFER         DAVIS
4     JOHNNY  LOLLOBRIGIDA

1b. Display the first and last name of each actor in a single column in upper case letters. Name the column Actor Name.

In [5]:
pd.read_sql_query("""
select upper(concat(first_name, " ", last_name)) as "Actor Name"
from actor
""", engine).head()

            Actor Name
0     PENELOPE GUINESS
1        NICK WAHLBERG
2             ED CHASE
3       JENNIFER DAVIS
4  JOHNNY LOLLOBRIGIDA

2a. You need to find the ID number, first name, and last name of an actor, of whom you know only the first name, "Joe." What is one query would you use to obtain this information?

In [6]:
pd.read_sql_query("""
select actor_id, first_name, last_name
from actor
where first_name = "Joe"
""", engine).head()

   actor_id first_name last_name
0         9        JOE     SWANK

2b. Find all actors whose last name contain the letters GEN

In [7]:
pd.read_sql_query("""
select first_name, last_name
from actor
where last_name like "%%GEN%%"
""", engine).head()

  first_name  last_name
0     VIVIEN     BERGEN
1      JODIE  DEGENERES
2       GINA  DEGENERES
3       NICK  DEGENERES

2c. Find all actors whose last names contain the letters LI. This time, order the rows by last name and first name, in that order

In [8]:
pd.read_sql_query("""
select first_name, last_name
from actor
where last_name like "%%LI%%"
order by first_name, last_name
""", engine).head()

  first_name last_name
0     AUDREY   OLIVIER
1        BEN    WILLIS
2       CUBA   OLIVIER
3       GENE    WILLIS
4       GREG   CHAPLIN

2d. Using IN, display the country_id and country columns of the following countries: Afghanistan, Bangladesh, and China

In [9]:
pd.read_sql_query("""
select country_id, country
from country
where country in ("Afghanistan", "Bangladesh", "China")
""", engine).head()

   country_id      country
0           1  Afghanistan
1          12   Bangladesh
2          23        China

3a. Add a middle_name column to the table actor. Position it between first_name and last_name. Hint: you will need to specify the data type.

In [10]:
RunSQL("""
alter table actor
add middle_name varchar(45);
""")
pd.read_sql_query("""
select * from actor
""", engine).head()

   actor_id first_name     last_name         last_update middle_name
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33        None
1         2       NICK      WAHLBERG 2006-02-15 04:34:33        None
2         3         ED         CHASE 2006-02-15 04:34:33        None
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33        None
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33        None

3b. You realize that some of these actors have tremendously long last names. Change the data type of the middle_name column to blobs

In [11]:
RunSQL("""
alter table actor
modify column middle_name blob;
""")
pd.read_sql_query("""
select * from actor
""", engine).head()

   actor_id first_name     last_name         last_update middle_name
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33        None
1         2       NICK      WAHLBERG 2006-02-15 04:34:33        None
2         3         ED         CHASE 2006-02-15 04:34:33        None
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33        None
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33        None

3c. Now delete the middle_name column.

In [12]:
RunSQL("""
alter table actor
drop column middle_name;
""")
pd.read_sql_query("""
select * from actor
""", engine).head()

   actor_id first_name     last_name         last_update
0         1   PENELOPE       GUINESS 2006-02-15 04:34:33
1         2       NICK      WAHLBERG 2006-02-15 04:34:33
2         3         ED         CHASE 2006-02-15 04:34:33
3         4   JENNIFER         DAVIS 2006-02-15 04:34:33
4         5     JOHNNY  LOLLOBRIGIDA 2006-02-15 04:34:33

4a. List the last names of actors, as well as how many actors have that last name.

In [13]:
pd.read_sql_query("""
select count(*) as count, last_name
from actor
group by last_name
""", engine).head()

   count last_name
0      3    AKROYD
1      3     ALLEN
2      1   ASTAIRE
3      1    BACALL
4      2    BAILEY

4b. List last names of actors and the number of actors who have that last name, but only for names that are shared by at least two actors

In [14]:
pd.read_sql_query("""
select *
from (
    select count(*) as count, last_name
    from actor
    group by last_name
) as a
where a.count >= 2
""", engine).head()

   count last_name
0      3    AKROYD
1      3     ALLEN
2      2    BAILEY
3      2    BENING
4      3     BERRY

4c. Oh, no! The actor HARPO WILLIAMS was accidentally entered in the actor table as GROUCHO WILLIAMS, the name of Harpo's second cousin's husband's yoga teacher. Write a query to fix the record.

In [15]:
RunSQL("""
update actor
set first_name = "HARPO", last_name = "WILLIAMS"
where first_name = "GROUCHO"
    and last_name = "WILLIAMS";
""")
pd.read_sql_query("""
select *
from actor
where last_name = "WILLIAMS"
""", engine).head()

   actor_id     first_name last_name         last_update
0        72           SEAN  WILLIAMS 2006-02-15 04:34:33
1       137         MORGAN  WILLIAMS 2006-02-15 04:34:33
2       172  MUCHO GROUCHO  WILLIAMS 2018-02-24 09:59:12

4d. Perhaps we were too hasty in changing GROUCHO to HARPO. It turns out that GROUCHO was the correct name after all! In a single query, if the first name of the actor is currently HARPO, change it to GROUCHO. Otherwise, change the first name to MUCHO GROUCHO, as that is exactly what the actor will be with the grievous error. BE CAREFUL NOT TO CHANGE THE FIRST NAME OF EVERY ACTOR TO MUCHO GROUCHO, HOWEVER! (Hint: update the record using a unique identifier.)

In [16]:
RunSQL("""
update actor
set first_name = IF(first_name = "HARPO", "GROUCHO", "MUCHO GROUCHO")
where actor_id = 172
""")
pd.read_sql_query("""
select first_name, last_name
from actor
where last_name = "WILLIAMS"
""", engine).head()

      first_name last_name
0           SEAN  WILLIAMS
1         MORGAN  WILLIAMS
2  MUCHO GROUCHO  WILLIAMS

5a. You cannot locate the schema of the address table. Which query would you use to re-create it?

In [17]:
pd.read_sql_query("""
SHOW CREATE TABLE address
""", engine).to_dict()["Create Table"][0]

'CREATE TABLE `address` (\n  `address_id` smallint(5) unsigned NOT NULL AUTO_INCREMENT,\n  `address` varchar(50) NOT NULL,\n  `address2` varchar(50) DEFAULT NULL,\n  `district` varchar(20) NOT NULL,\n  `city_id` smallint(5) unsigned NOT NULL,\n  `postal_code` varchar(10) DEFAULT NULL,\n  `phone` varchar(20) NOT NULL,\n  `location` geometry NOT NULL,\n  `last_update` timestamp NOT NULL DEFAULT CURRENT_TIMESTAMP ON UPDATE CURRENT_TIMESTAMP,\n  PRIMARY KEY (`address_id`),\n  KEY `idx_fk_city_id` (`city_id`),\n  SPATIAL KEY `idx_location` (`location`),\n  CONSTRAINT `fk_address_city` FOREIGN KEY (`city_id`) REFERENCES `city` (`city_id`) ON UPDATE CASCADE\n) ENGINE=InnoDB AUTO_INCREMENT=606 DEFAULT CHARSET=utf8'

6a. Use JOIN to display the first and last names, as well as the address, of each staff member. Use the tables staff and address:

In [18]:
pd.read_sql_query("""
select staff.first_name, last_name, address.address
from staff
    join address on address.address_id = staff.address_id
""", engine).head()

  first_name last_name               address
0       Mike   Hillyer     23 Workhaven Lane
1        Jon  Stephens  1411 Lillydale Drive

6b. Use JOIN to display the total amount rung up by each staff member in August of 2005. Use tables staff and payment.

In [19]:
pd.read_sql_query("""
select staff.first_name, last_name, sum(payment.amount) as "total_rung_up"
from staff
    join payment on staff.staff_id = payment.payment_id
where payment_date like "2005-08%%"
group by staff.staff_id
""", engine).head()

Empty DataFrame
Columns: [first_name, last_name, total_rung_up]
Index: []

6c. List each film and the number of actors who are listed for that film. Use tables film_actor and film. Use inner join.

In [20]:
pd.read_sql_query("""
select count(film_actor.actor_id) as "number_of_actors", film.title
from film_actor
    join film on film_actor.film_id = film.film_id
group by film_actor.film_id
""", engine).head()

   number_of_actors             title
0                10  ACADEMY DINOSAUR
1                 4    ACE GOLDFINGER
2                 5  ADAPTATION HOLES
3                 5  AFFAIR PREJUDICE
4                 5       AFRICAN EGG

6d. How many copies of the film Hunchback Impossible exist in the inventory system?

In [21]:
pd.read_sql_query("""
select count(*) as "number_of_copies"
from inventory
    join film on inventory.film_id = film.film_id
where film.title = "Hunchback Impossible"
""", engine).head()

   number_of_copies
0                 6

Using the tables payment and customer and the JOIN command, list the total paid by each customer. List the customers alphabetically by last name:

In [22]:
pd.read_sql_query("""
select customer.first_name, last_name, sum(payment.amount) as "total_paid"
from customer
    join payment on customer.customer_id = payment.customer_id
group by customer.customer_id
order by customer.last_name
""", engine).head()

  first_name  last_name  total_paid
0     RAFAEL      ABNEY       97.79
1  NATHANIEL       ADAM      133.72
2   KATHLEEN      ADAMS       92.73
3      DIANA  ALEXANDER      105.73
4     GORDON     ALLARD      160.68

7a. The music of Queen and Kris Kristofferson have seen an unlikely resurgence. As an unintended consequence, films starting with the letters K and Q have also soared in popularity. Use subqueries to display the titles of movies starting with the letters K and Q whose language is English.

In [23]:
pd.read_sql_query("""
select film.title, language.name
from film
    join language on film.language_id = language.language_id
where film.title like "Q%%"
    or film.title like "K%%"
    and language.name = "English"
""", engine)

               title     name
0      KANE EXORCIST  English
1        KARATE MOON  English
2   KENTUCKIAN GIANT  English
3      KICK SAVANNAH  English
4   KILL BROTHERHOOD  English
5    KILLER INNOCENT  English
6     KING EVOLUTION  English
7         KISS GLORY  English
8      KISSING DOLLS  English
9      KNOCK WARLOCK  English
10  KRAMER CHOCOLATE  English
11     KWAI HOMEWARD  English
12        QUEEN LUKE  English
13   QUEST MUSSOLINI  English
14       QUILLS BULL  English

7b. Use subqueries to display all actors who appear in the film Alone Trip.

In [24]:
pd.read_sql_query("""
select count(film_actor.actor_id) as "number_of_actors"
from film_actor
    join film on film_actor.film_id = film.film_id
where film.title = "Alone Trip"
""", engine).head()

   number_of_actors
0                 8

7c. You want to run an email marketing campaign in Canada, for which you will need the names and email addresses of all Canadian customers. Use joins to retrieve this information

In [25]:
pd.read_sql_query("""
select customer.first_name, last_name, email, country.country
from customer
    join address on address.address_id = customer.address_id
    join city on address.city_id = city.city_id
    join country on city.country_id = country.country_id
where country.country = "Canada"
""", engine).head()

  first_name  last_name                                 email country
0    DERRICK    BOURQUE    DERRICK.BOURQUE@sakilacustomer.org  Canada
1    DARRELL      POWER      DARRELL.POWER@sakilacustomer.org  Canada
2    LORETTA  CARPENTER  LORETTA.CARPENTER@sakilacustomer.org  Canada
3     CURTIS       IRBY        CURTIS.IRBY@sakilacustomer.org  Canada
4       TROY    QUIGLEY       TROY.QUIGLEY@sakilacustomer.org  Canada

7d. Sales have been lagging among young families, and you wish to target all family movies for a promotion. Identify all movies categorized as famiy films.

In [28]:
pd.read_sql_query("""
select film.title, category.name
from category
    join film_category on category.category_id = film_category.category_id
    join film on film_category.film_id = film.film_id
where category.name = "Family"
""", engine).head()

             title    name
0      AFRICAN EGG  Family
1    APACHE DIVINE  Family
2   ATLANTIS CAUSE  Family
3  BAKED CLEOPATRA  Family
4        BANG KWAI  Family

7e. Display the most frequently rented movies in descending order.

In [31]:
pd.read_sql_query("""
select film.title,
    count(rental.rental_id) as "Times_Rented"
from rental
    join inventory on rental.inventory_id = inventory.inventory_id
    join film on inventory.film_id = film.film_id
group by film.film_id
order by Times_Rented desc
""", engine).head()

                 title  Times_Rented
0   BUCKET BROTHERHOOD            34
1     ROCKETEER MOTHER            33
2       GRIT CLOCKWORK            32
3  RIDGEMONT SUBMARINE            32
4       FORWARD TEMPLE            32

7f. Write a query to display how much business, in dollars, each store brought in.

In [32]:
pd.read_sql_query("""
select sum(payment.amount) as "total_brought_in",
    store.store_id,
    address.address
from payment
    join staff on payment.staff_id = staff.staff_id
    join store on staff.store_id = store.store_id
    join address on store.address_id = address.address_id
group by store.store_id
""", engine).head()

   total_brought_in  store_id             address
0          33489.47         1   47 MySakila Drive
1          33927.04         2  28 MySQL Boulevard

7g. Write a query to display for each store its store ID, city, and country.

In [34]:
pd.read_sql_query("""
select store.store_id,
    city.city,
    country.country
from store
    join address on store.address_id = address.address_id
    join city on address.city_id = city.city_id
    join country on city.country_id = country.country_id
""", engine).head()

   store_id        city    country
0         1  Lethbridge     Canada
1         2   Woodridge  Australia

7h. List the top five genres in gross revenue in descending order. (Hint: you may need to use the following tables: category, film_category, inventory, payment, and rental.)

In [35]:
pd.read_sql_query("""
select category.name,
    sum(payment.amount) as "gross_revenue"
from payment
    join rental on payment.rental_id = rental.rental_id
    join inventory on rental.inventory_id = inventory.inventory_id
    join film_category on inventory.film_id = film_category.film_id
    join category on film_category.category_id = category.category_id
group by category.category_id
order by gross_revenue desc
""", engine).head()

        name  gross_revenue
0     Sports        5314.21
1     Sci-Fi        4756.98
2  Animation        4656.30
3      Drama        4587.39
4     Comedy        4383.58

8a. In your new role as an executive, you would like to have an easy way of viewing the Top five genres by gross revenue. Use the solution from the problem above to create a view. If you haven't solved 7h, you can substitute another query to create a view.

In [48]:
RunSQL("""
drop view if exists top_selling_genres;
create view top_selling_genres as
    select category.name,
        sum(payment.amount) as "gross_revenue"
    from payment
        join rental on payment.rental_id = rental.rental_id
        join inventory on rental.inventory_id = inventory.inventory_id
        join film_category on inventory.film_id = film_category.film_id
        join category on film_category.category_id = category.category_id
    group by category.category_id
    order by gross_revenue desc
""")
pd.read_sql_query("""
select * from top_selling_genres
""", engine).head()

        name  gross_revenue
0     Sports        5314.21
1     Sci-Fi        4756.98
2  Animation        4656.30
3      Drama        4587.39
4     Comedy        4383.58

8b. How would you display the view that you created in 8a?

In [49]:
pd.read_sql_query("""
select * from top_selling_genres
""", engine).head()

        name  gross_revenue
0     Sports        5314.21
1     Sci-Fi        4756.98
2  Animation        4656.30
3      Drama        4587.39
4     Comedy        4383.58

8c. You find that you no longer need the view top_five_genres. Write a query to delete it.

In [50]:
RunSQL("""
drop view if exists top_selling_genres;
""")